src/soap/AddTreatyApp-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddTreatyApp>
         <tem:treatyApp>
            <tem:TreatyId>
               <tem:Value>{{{payload.TreatyId}}}</tem:Value>
            </tem:TreatyId>			
            <tem:StateId>
               <tem:Value>{{{payload.StateId}}}</tem:Value> 
            </tem:StateId>			
            <tem:DayDate>
               <tem:Year>{{{payload.DayDate.Year}}}</tem:Year>
               <tem:Month>{{{payload.DayDate.Month}}}</tem:Month>
               <tem:Day>{{{payload.DayDate.Day}}}</tem:Day>
            </tem:DayDate>        
            <tem:No>
               <tem:Value>{{{payload.No}}}</tem:Value>
            </tem:No>   
            <tem:OrgDate>
               <tem:Year>{{{payload.OrgDate.Year}}}</tem:Year>
               <tem:Month>{{{payload.OrgDate.Month}}}</tem:Month>
               <tem:Day>{{{payload.OrgDate.Day}}}</tem:Day>
            </tem:OrgDate>
            <tem:DateFrom>
               <tem:Year>{{{payload.DateFrom.Year}}}</tem:Year>
               <tem:Month>{{{payload.DateFrom.Month}}}</tem:Month>
               <tem:Day>{{{payload.DateFrom.Day}}}</tem:Day>
            </tem:DateFrom>            
            <tem:DateInto>
               <tem:Year>{{{payload.DateInto.Year}}}</tem:Year>
               <tem:Month>{{{payload.DateInto.Month}}}</tem:Month>
               <tem:Day>{{{payload.DateInto.Day}}}</tem:Day>
            </tem:DateInto>			
            <tem:Code>{{{payload.Code}}}</tem:Code>			
           <tem:CrncyAmount>
               <tem:Value>{{{payload.CrncyAmount}}}</tem:Value>
            </tem:CrncyAmount>			
            <tem:Share>
               <tem:Value>{{{payload.Share}}}</tem:Value>
            </tem:Share>			
            <tem:Provision>
               <tem:Value>{{{payload.Provision}}}</tem:Value>
            </tem:Provision>			
            <tem:Risk>
               <tem:Value>{{{payload.Risk}}}</tem:Value>
            </tem:Risk>			
            <tem:DurationKind>
               <tem:Value>{{{payload.DurationKind}}}</tem:Value>
            </tem:DurationKind>			
            <tem:PawnKind>
               <tem:Value>{{{payload.DurationKind}}}</tem:Value>
            </tem:PawnKind>			
            <tem:CreditGrade></tem:CreditGrade>  
            <tem:AmountId>
               <tem:Value>{{{payload.AmountId}}}</tem:Value>
            </tem:AmountId>            
            <tem:Info>{{{payload.Info}}}</tem:Info>            
            <tem:Rate>
               <tem:Value>{{{payload.Rate}}}</tem:Value>
            </tem:Rate>
            <tem:ProcessFlag>
               <tem:Value>{{{payload.ProcessFlag}}}</tem:Value>
            </tem:ProcessFlag>            
            <tem:Status>
               <tem:Value>{{{payload.ProcessFlag}}}</tem:Value>
            </tem:Status>			
         </tem:treatyApp>
      </tem:AddTreatyApp>
   </soapenv:Body>
</soapenv:Envelope>
